# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8n + PPAP-EMA + HyperGraphFusion
# 说明：
# 1) 在 Backbone 末端插入 PPAPEMA（SPPF 前）
# 2) 收集 4 个 C2f + SPPF，多层对齐后做 HyperGraphFusion
# 3) HyperGraphFusion 输出替代原 P5 主干输入 Neck

nc: 80  # 按你的数据集类别数，训练时会被 data.yaml 覆盖

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 3, C2f, [128, True]]           # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 6, C2f, [256, True]]           # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 6, C2f, [512, True]]           # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 3, C2f, [1024, True]]          # 8
  - [-1, 1, PPAPEMA, [8, 0.05, 8, 64, 1]]   # 9  groups, topk_ratio, topk_min, topk_max, gn_groups
  - [-1, 1, SPPF, [1024, 5]]            # 10
  - [[2, 4, 6, 8, 10], 1, KDEHyperGraphFusion, [1024, 4, 64, 0.1]]  # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13
  - [-1, 3, C2f, [512]]                          # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16
  - [-1, 3, C2f, [256]]                          # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19
  - [-1, 3, C2f, [512]]                          # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22
  - [-1, 3, C2f, [1024]]                         # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]              # 24
