# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8n + PPAP-EMA + KDE-HyperGraph + CLAG-RGCU
# 完整版创新点：
# 1) Backbone 末端插入 PPAPEMA
# 2) 从 4 个 C2f + SPPF 收集多层特征，分别生成 R3/R4/R5 三个 KDE 超图尺度输出
# 3) Neck 顶层两次 top-down 融合使用 CLAGRGCUFuse

nc: 80

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4
  - [-1, 3, C2f, [128, True]]                    # 2  C2f-1
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8
  - [-1, 6, C2f, [256, True]]                    # 4  C2f-2
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 6, C2f, [512, True]]                    # 6  C2f-3
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]                   # 8  C2f-4
  - [-1, 1, PPAPEMA, [8, 0.05, 8, 64, 1]]        # 9
  - [-1, 1, SPPF, [1024, 5]]                     # 10

  # KDE-HyperGraph outputs (R3 / R4 / R5)
  - [[2, 4, 6, 8, 10], 1, KDEHyperGraphFusion, [256, 1, 48, 0.1]]   # 11 -> R3 (target=layer 4 size)
  - [[2, 4, 6, 8, 10], 1, KDEHyperGraphFusion, [512, 2, 48, 0.1]]   # 12 -> R4 (target=layer 6 size)
  - [[2, 4, 6, 8, 10], 1, KDEHyperGraphFusion, [1024, 4, 48, 0.1]]  # 13 -> R5 (target=layer 10 size)

head:
  # top-down with CLAG + RGCU
  - [[13, 12], 1, CLAGRGCUFuse, [512]]           # 14
  - [-1, 3, C2f, [512]]                          # 15  P4_td

  - [[15, 11], 1, CLAGRGCUFuse, [256]]           # 16
  - [-1, 3, C2f, [256]]                          # 17  P3_out

  # bottom-up path aggregation (keep YOLOv8 PAN)
  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 15], 1, Concat, [1]]                   # 19
  - [-1, 3, C2f, [512]]                          # 20  P4_out

  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 13], 1, Concat, [1]]                   # 22
  - [-1, 3, C2f, [1024]]                         # 23  P5_out

  - [[17, 20, 23], 1, Detect, [nc]]              # 24
